insert into _User
values
(1, 'anavarich29@gmail.com', '123', 0, '123', '123'),
(2, 'user1@gmail.com', '123', 2, '123', '123'),
(3, 'user2@gmail.com', '123', 2, '123', '123'),
(4, 'user3@gmail.com', '123', 2, '123', '123'),
(5, 'driver1@gmail.com', '123', 1, '123', '123'),
(6, 'driver2@gmail.com', '123', 1, '123', '123'),
(7, 'driver3@gmail.com', '123', 1, '123', '123')

select * from _User

insert into _UserProfile
values
(1, 'Наварич Андрей Евгеньевич', '+123', SYSDATETIME()),
(2, 'Иванов Иван Иваннович', '+123', SYSDATETIME()),
(3, 'Петров Петр Петрович', '+123', SYSDATETIME()),
(4, 'Сергеев Сергей Сергеевич', '+123', SYSDATETIME()),
(5, 'Семенов Семён Семёнович', '+123', SYSDATETIME()),
(6, 'Павлов Павел Павлович', '+123', SYSDATETIME()),
(7, 'Андреев Андрей Андреевич', '+123', SYSDATETIME())

select * from _UserProfile inner join _User on _UserProfile.id = _User.id;

INSERT INTO _CAR
VALUES
  ('А124ВС', 2000, 'Грузовик', 5),
  ('У997ХХ', 500, 'Седан', 6),
  ('A2905M', 400, 'Седан', 7)

select * from _Car inner join _UserProfile on driver_id = id


INSERT INTO _Cargo
VALUES
  (1, 1000, 'Ящик 1', 2 , 2),
  (2, 1000, 'Ящик 3', 3, 3),
  (3, 2000, 'Ящик 2', 2, 4),
  (4, 2000, 'Ящик 4', 1, 2),
  (5, 2000, 'Ящик 5', 4, 3),
  (6, 2000, 'Ящик 5',10, 4)

select * from _Cargo inner join _UserProfile on owner_id = _UserProfile.id

INSERT INTO _Order
VALUES
    (1, 'А124ВС', 2, '2024-03-10', 'Точка отправления 1', 'Точка назначения 1', 'Выполнен', 200),
    (2, 'А124ВС', 2, '2024-03-22', 'Точка отправления 2', 'Точка назначения 2', 'Не выполнен', 300),
    (6, 'У997ХХ', 3, '2023-01-01', 'Точка отправления 6', 'Точка назначения 6',  'Выполнен', 50),
    (7, 'У997ХХ', 3, '2023-09-10', 'Точка отправления 7', 'Точка назначения 7', 'Не выполнен', 300),
    (11, 'A2905M', 4,'2024-05-01', 'Точка отправления 11', 'Точка назначения 11', 'Выполнен', 100),
    (12, 'A2905M', 4,'2024-04-01', 'Точка отправления 12', 'Точка назначения 12', 'Не выполнен', 150)


delete from _Order

INSERT INTO _OrderCargo
VALUES
(1, 1, 1),
(2, 2, 2),
(3, 3, 6),
(4, 4, 7),
(5, 5, 11),
(6, 6, 12)